app/Http/Controllers/EdukasiController.php

select * from `edukasi` order by `created_at` desc limit 15 offset 0
select count(*) as aggregate from `edukasi`
---
    public function index(Request $request)
    {
        $query = Edukasi::query();

        if ($search = $request->input('search')) {
            $query->where(function ($q) use ($search) {
                $q->where('judul', 'LIKE', "%{$search}%")
                    ->orWhere('deskripsi', 'LIKE', "%{$search}%");
            });
        }

        $edukasi = $query->latest()->paginate(15);

select * from `edukasi` where `edukasi`.`id` = '27' limit 1
---
    public function show($id)
    {
        $edukasi = Cache::remember("edukasi_{$id}", 3600, function () use ($id) {
            return Edukasi::findOrFail($id);