app/Http/Controllers/KuisionerController.php

    public function jawabKuisioner($pasien_id)
    {
        $pasien = Pasien::findOrFail($pasien_id);
        $kategori = KategoriPertanyaan::with('pertanyaan.opsiJawaban')->get();
---
select * from `pasien` where `pasien`.`id` = '65' limit 1
select * from `kategori_pertanyaan`
select * from `opsi_jawaban` where `opsi_jawaban`.`pertanyaan_id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31)
select * from `pertanyaan` where `pertanyaan`.`kategori_id` in (1, 2, 3)

    public function simpanJawaban(Request $request, $pasien_id)
{
    $validator = Validator::make($request->all(), [
        'jawaban' => 'nullable|array',
        'jawaban.*' => 'nullable|array',
        'jawaban.*.opsi_jawaban_id' => 'nullable|exists:opsi_jawaban,id',
        'jawaban.*.keterangan' => 'nullable|string|max:1000',
    ]);

    if ($validator->fails()) {
        return response()->json(['message' => 'Validasi gagal', 'errors' => $validator->errors()], 422);
    }

    DB::beginTransaction();

    try {
        $pasien = Pasien::findOrFail($pasien_id);

        JawabanPasien::where('pasien_id', $pasien_id)->delete();
---
select * from `pasien` where `pasien`.`id` = '31' limit 1
delete from `jawaban_pasien` where `pasien_id` = '31'