app/Http/Controllers/NamaKondisiGigiController.php

select * from `namakondisigigi`
---
    public function index()
    {
        $namaKondisiGigi = NamaKondisiGigi::all();