app/Http/Controllers/PasienController.php

    public function index(Request $request)
    {
        $datas = Pasien::when($request->keyword, function ($query, $keyword) {
            $query->where(function ($q) use ($keyword) {
                $q->where('nama', 'LIKE', "%{$keyword}%")
                    ->orWhere('no_hp', 'LIKE', "%{$keyword}%")
                    ->orWhere('alamat_lengkap', 'LIKE', "%{$keyword}%");
            });
        })
            ->paginate(10);
---
select * from `pasien` limit 10 offset 0
select count(*) as aggregate from `pasien`

    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'nama' => 'required',
            'tmp_lahir' => 'nullable',
            'tgl_lahir' => 'nullable|date',
            'jk' => 'nullable',
            'status_menikah' => 'nullable',
            'agama' => 'nullable',
            'pendidikan' => 'nullable',
            'pekerjaan' => 'nullable',
            'alamat_lengkap' => 'nullable',
            'kelurahan' => 'nullable',
            'kecamatan' => 'nullable',
            'kabupaten' => 'nullable',
            'kodepos' => 'nullable',
            'no_hp' => 'nullable',
            'kewarganegaraan' => 'nullable',
            'alergi' => 'nullable',
        ]);

        try {
            $pasien = Pasien::create($validatedData);
---
insert into `pasien` (`nama`, `tmp_lahir`, `tgl_lahir`, `jk`, `status_menikah`, `agama`, `pendidikan`, `pekerjaan`, `alamat_lengkap`, `kelurahan`, `kecamatan`, `kabupaten`, `kodepos`, `no_hp`, `kewarganegaraan`, `alergi`, `updated_at`, `created_at`) values ('danang 2', 'asdsad', '2024-09-04', 'Perempuan', '', 'Katholik', 'SD', 'Wiraswasta', 'asdsad', 'sad', 'sadsad', 'sadsad', '324', '64634543', 'WNA', 'sadsadsad', '2024-09-13 18:38:21', '2024-09-13 18:38:21')

    public function delete($id)
    {
        DB::beginTransaction();

        try {
            $pasien = Pasien::findOrFail($id);
            $pasien->delete();

            // Delete related records
            Rekam::where('pasien_id', $id)->delete();
            RekamGigi::where('pasien_id', $id)->delete();
            PengeluaranObat::where('pasien_id', $id)->delete();
---
select * from `pasien` where `pasien`.`id` = '14' limit 1
delete from `pasien` where `id` = 14
delete from `rekam` where `pasien_id` = '14'
delete from `rekam_gigi` where `pasien_id` = '14'
delete from `pengeluaran_obat` where `pasien_id` = '14'