app/Http/Controllers/RekamGigiController.php

    public function index($pasienId)
    {
        $pasien = Pasien::findOrFail($pasienId);
        $tindakan = Tindakan::all();
        $kondisi_gigi = KondisiGigi::all();
        $pem_gigi = RekamGigi::where('pasien_id', $pasienId)->get();
---
select * from `pasien` where `pasien`.`id` = '35' limit 1
select * from `tindakan`
select * from `kondisi_gigi`
select * from `rekam_gigi` where `pasien_id` = '35'

    public function store(Request $request, $pasienId)
    {
        if (!$request->has('element_gigi') || empty($request->element_gigi)) {
            return redirect()->back()->with('gagal', 'Tambahkan dulu rincian pemeriksaan baru menyimpan data');
        }

        try {
            DB::transaction(function () use ($request, $pasienId) {
                RekamGigi::where('pasien_id', $pasienId)->delete();

                $userId = auth()->id();
                $rekam = Rekam::firstOrCreate(
                    ['pasien_id' => $pasienId],
                    [
                        'tgl_rekam' => now(),
                        'user_id' => $userId,
                        'keluhan' => $request->keluhan ?? 'Tidak ada keluhan',
                    ]
                );
---
delete from `rekam_gigi` where `pasien_id` = '68'
select * from `rekam` where (`pasien_id` = '68') limit 1

                    ];
                }, $request->element_gigi, $request->pemeriksaan ?? [], $request->diagnosa ?? [], $request->tindakan ?? []);

                RekamGigi::insert($rekamGigiData);
---
insert into `rekam_gigi` (`diagnosa`, `elemen_gigi`, `pasien_id`, `pemeriksaan`, `rekam_id`, `tindakan`, `user_id`) values ('K02.3', '31', '68', 'Ο', 78, 'R1', 1)

    public function edit($pasienId)
    {
        $pasien = Pasien::findOrFail($pasienId);

         $rekam = Rekam::where('pasien_id', $pasienId)->latest()->first();

    if (!$rekam) {
        return redirect()->route('rekam.tambah', ['pasienid' => $pasienId])
            ->with('info', 'Belum ada rekam medis untuk pasien ini. Silakan tambahkan rekam baru.');
    }


        $tindakan = Tindakan::all();
        $kondisi_gigi = KondisiGigi::all();
        $pem_gigi = RekamGigi::where('pasien_id', $pasienId)->get();
---
select * from `pasien` where `pasien`.`id` = '72' limit 1
select * from `rekam` where `pasien_id` = '72' order by `created_at` desc limit 1
select * from `tindakan`
select * from `kondisi_gigi`
select * from `rekam_gigi` where `pasien_id` = '72'

    public function update(Request $request, $pasienId)
    {
        try {
            DB::transaction(function () use ($request, $pasienId) {
                RekamGigi::where('pasien_id', $pasienId)->delete();

                $userId = auth()->id();
                $rekam = Rekam::updateOrCreate(
                    ['pasien_id' => $pasienId],
                    [
                        'tgl_rekam' => now(),
                        'user_id' => $userId,
                        'keluhan' => $request->keluhan ?? 'Tidak ada keluhan',
                    ]
                );

                $rekamGigiData = array_map(function ($elementId, $pemeriksaan, $diagnosa, $tindakan) use ($pasienId, $userId, $rekam) {
                    return [
                        'pasien_id' => $pasienId,
                        'user_id' => $userId,
                        'rekam_id' => $rekam->id,
                        'elemen_gigi' => $elementId,
                        'pemeriksaan' => $pemeriksaan ?? null,
                        'diagnosa' => $diagnosa ?? null,
                        'tindakan' => $tindakan ?? null,
                    ];
                }, $request->element_gigi, $request->pemeriksaan ?? [], $request->diagnosa ?? [], $request->tindakan ?? []);

                RekamGigi::insert($rekamGigiData);
---
delete from `rekam_gigi` where `pasien_id` = '60'
select * from `rekam` where (`pasien_id` = '60') limit 1
insert into `rekam_gigi` (`diagnosa`, `elemen_gigi`, `pasien_id`, `pemeriksaan`, `rekam_id`, `tindakan`, `user_id`) values ('K02.3', '21', '60', '∑', 73, '', 1), ('', '32', '60', '⚫', 73, 'P1', 1), ('', '11', '60', 'Ο', 73, 'P1', 1)