app/Http/Controllers/RekamController.php

    public function index(Request $request)
    {
        $query = Rekam::latest()->select('rekam.*')
            ->leftJoin('pasien', 'rekam.pasien_id', '=', 'pasien.id');

        if ($request->keyword) {
            $query->where(function ($q) use ($request) {
                $q->where('rekam.tgl_rekam', 'LIKE', "%{$request->keyword}%")
                    ->orWhere('pasien.nama', 'LIKE', "%{$request->keyword}%")
                    ->orWhere('pasien.no_rm', 'LIKE', "%{$request->keyword}%");
            });
        }

        if (!auth()->user()->is_admin) {
            $query->where('user_id', auth()->id());
        }

        $rekam = $query->paginate(10);
---
select `rekam`.* from `rekam` left join `pasien` on `rekam`.`pasien_id` = `pasien`.`id` where `user_id` = 1 order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `rekam` left join `pasien` on `rekam`.`pasien_id` = `pasien`.`id` where `user_id` = 1

    public function add(Request $request)
    {
        $pasien = Pasien::findOrFail($request->pasien_id);
---
select * from `pasien` where `pasien`.`id` = '29' limit 1

    public function detail(Request $request, $pasienId)
    {
        $pasien = Pasien::with(['jawabanPasien.pertanyaan.kategori', 'jawabanPasien.opsiJawaban'])
            ->findOrFail($pasienId);

        $rekamLatest = Rekam::where('pasien_id', $pasienId)->latest()->first();

        $rekam = Rekam::where('pasien_id', $pasienId)
            ->when($request->keyword, function ($query) use ($request) {
                $query->where('tgl_rekam', 'LIKE', "%{$request->keyword}%");
            })
            ->latest()
            ->paginate(5);

        $riwayattindakan = RekamGigi::with(['diagnosis', 'tindak'])->where('pasien_id', $pasienId)
            ->latest()
            ->get()
            ->map(function ($item) {
                $item->created_at = $item->created_at ?? now();
                return $item;
            });

        if ($rekamLatest) {
            auth()->user()->notifications()->where('data->no_rekam', $rekamLatest->no_rekam)->update(['read_at' => now()]);
        }

        $kondisi_gigi = KondisiGigi::all()->groupBy('kode')->map(function ($group) {
            $first = $group->first();
            $first->color = $this->getColorForCondition($first->kode);
            return $first;
        })->values();

        $odontogram_data = RekamGigi::where('pasien_id', $pasienId)->pluck('pemeriksaan', 'elemen_gigi');
---
select * from `jawaban_pasien` where `jawaban_pasien`.`pasien_id` in (60)
select * from `opsi_jawaban` where `opsi_jawaban`.`id` in (2, 32, 50, 63, 78, 87)
select * from `pasien` where `pasien`.`id` = '60' limit 1
select * from `pertanyaan` where `pertanyaan`.`id` in (2, 7, 13, 19, 27, 31)
select * from `rekam` where `pasien_id` = '60' order by `created_at` desc limit 1
select * from `rekam` where `pasien_id` = '60' order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `rekam` where `pasien_id` = '60'
select * from `rekam_gigi` where `pasien_id` = '60' order by `created_at` desc
update `notifications` set `read_at` = '2024-09-12 20:01:40', `notifications`.`updated_at` = '2024-09-12 20:01:40' where `notifications`.`notifiable_type` = 'App\User' and `notifications`.`notifiable_id` = 1 and `notifications`.`notifiable_id` is not null and json_unquote(json_extract(`data`, '$."no_rekam"')) = 'REG#2024090960' order by `created_at` desc
select * from `kondisi_gigi`
select `pemeriksaan`, `elemen_gigi` from `rekam_gigi` where `pasien_id` = '60'

    public function store(Request $request)
    {
        try {
            $validatedData = $request->validate([
                'tgl_rekam' => 'required|date',
                'pasien_id' => 'required|exists:pasien,id',
                'keluhan' => 'nullable|string',
            ]);

            DB::beginTransaction();

            $keluhan = $validatedData['keluhan'] ?? 'Tidak ada keluhan';

            $pasien = Pasien::findOrFail($validatedData['pasien_id']);
            $user = auth()->user();

            // Simpan data rekam medis
            $rekam = Rekam::create([
                'tgl_rekam' => $validatedData['tgl_rekam'],
                'pasien_id' => $pasien->id,
                'rekam_id' => $pasien->id,
                'no_rekam' => "REG#" . now()->format('Ymd') . $pasien->id,
                'petugas_id' => $user->id,
                'user_id' => $user->id,
                'keluhan' => $keluhan,
            ]);
---
select * from `pasien` where `pasien`.`id` = '25' limit 1
insert into `rekam` (`tgl_rekam`, `pasien_id`, `no_rekam`, `petugas_id`, `user_id`, `keluhan`, `updated_at`, `created_at`) values ('2024-09-13', 25, 'REG#2024091325', 1, 1, 'Tidak ada keluhan', '2024-09-13 18:35:46', '2024-09-13 18:35:46')