app/Http/Controllers/RekamMedisKaderController.php

select * from `pasien` where `pasien`.`id` = '34' limit 1
select * from `namakondisigigi`
---
    public function create($pasien_id)
    {
        $pasien = Pasien::findOrFail($pasien_id);
        $kondisiGigi = NamaKondisiGigi::all();

insert into `rekammediskader` (`created_at`, `keterangan`, `namakondisigigi_id`, `pasien_id`, `total`, `updated_at`, `user_id`) values ('2024-09-12 04:58:24', 'asdasdsa', '3', '66', '3', '2024-09-12 04:58:24', 1), ('2024-09-12 04:58:24', 'saddasd', '4', '66', '1', '2024-09-12 04:58:24', 1)
---
    public function store(Request $request)
    {
        $validatedData = $request->validate([
            'pasien_id' => 'required|exists:pasien,id',
            'kondisi_gigi' => 'required|array',
            'kondisi_gigi.*' => 'exists:namakondisigigi,id',
            'total' => 'required|array',
            'total.*' => 'numeric',
            'keterangan' => 'nullable|array',
            'keterangan.*' => 'nullable|string',
        ]);

        DB::beginTransaction();

        try {
            $rekamMedisData = array_map(function ($index) use ($request, $validatedData) {
                return [
                    'pasien_id' => $validatedData['pasien_id'],
                    'user_id' => Auth::id(),
                    'namakondisigigi_id' => $validatedData['kondisi_gigi'][$index],
                    'total' => $validatedData['total'][$index],
                    'keterangan' => $validatedData['keterangan'][$index] ?? null,
                    'created_at' => now(),
                    'updated_at' => now(),
                ];
            }, array_keys($validatedData['kondisi_gigi']));

            RekamMedisKader::insert($rekamMedisData);

select * from `namakondisigigi`
---
    public function edit(RekamMedisKader $rekamMedisKader)
    {
        $kondisiGigi = NamaKondisiGigi::all();