app/Http/Controllers/RekamPemeriksaanController.php

    public function pemeriksaan(Request $request)
    {
        $validatedData = $request->validate([
            'rekam_id' => 'required',
            'pasien_id' => 'required',
            'pemeriksaan' => 'required',
        ]);

        try {
            $rekam = Rekam::findOrFail($validatedData['rekam_id']);
---
select * from `rekam` where `rekam`.`id` = '0' limit 1

    public function tindakan(Request $request)
    {
        $validatedData = $request->validate([
            'rekam_id' => 'required',
            'pasien_id' => 'required',
            'tindakan' => 'required',
        ]);

        try {
            $rekam = Rekam::findOrFail($validatedData['rekam_id']);
---
select * from `rekam` where `rekam`.`id` = '0' limit 1