app/Http/Controllers/TogaController.php

    public function index(Request $request)
    {
        $search = $request->input('search');

        $query = Toga::query();

        if ($search) {
            $query->where('judul', 'LIKE', "%{$search}%")
                ->orWhere('deskripsi', 'LIKE', "%{$search}%");
        }

        $toga = $query->latest()->paginate(12);
---
select * from `toga` order by `created_at` desc limit 12 offset 0
select count(*) as aggregate from `toga`