app/Models/DashboardQuery.php

select count(*) as aggregate from `rekam` where date(`tgl_rekam`) = '2024-09-13' and `user_id` = 2
---
    public function pasienHariini()
    {
        return Rekam::whereDate('tgl_rekam', date('Y-m-d'))
            ->when($this->role !== "Admin", function ($query) {
                return $query->where('user_id', $this->user->id);
            })
            ->count();

select count(*) as aggregate from `rekam` where month(`tgl_rekam`) = '09' and year(`tgl_rekam`) = '2024' and `user_id` = 2
---
    public function perikaBulanini()
    {
        return Rekam::whereMonth('tgl_rekam', date('m'))
            ->whereYear('tgl_rekam', date('Y'))
            ->when($this->role !== "Admin", function ($query) {
                return $query->where('user_id', $this->user->id);
            })
            ->count();

select count(*) as aggregate from `rekam` where year(`tgl_rekam`) = '2024' and `user_id` = 2
---
    public function perikaTahunini()
    {
        return Rekam::whereYear('tgl_rekam', date('Y'))
            ->when($this->role !== "Admin", function ($query) {
                return $query->where('user_id', $this->user->id);
            })
            ->count();

select count(*) as aggregate from `rekam` where `user_id` = 2
---
    public function totalPeriksa()
    {
        return Rekam::when($this->role !== "Admin", function ($query) {
            return $query->where('user_id', $this->user->id);
        })->count();

select count(*) as aggregate from `pasien`
select count(distinct `pasien_id`) as aggregate from `rekam` where `user_id` = 2
---
    public function totalPasien()
    {
        if ($this->role === "Admin") {
            return Pasien::count();
        } elseif ($this->role === "Dokter" || $this->role === "KaderKesehatan") {
            return Rekam::where('user_id', $this->user->id)->distinct('pasien_id')->count('pasien_id');

select * from `rekam` where `user_id` = 2 order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `rekam` where `user_id` = 2
---
    public function rekam_day($search = null, $perPage = 5)
{

    $query = Rekam::latest()
        ->when($this->role !== "Admin", function ($query) {
            return $query->where('user_id', $this->user->id);
        });

    if ($search) {
        $query->where(function($q) use ($search) {
            $q->whereHas('pasien', function ($subQ) use ($search) {
                $subQ->where('nama', 'like', "%{$search}%");
            })->orWhere('keluhan', 'like', "%{$search}%");
        });
    }

    $results = $query->paginate($perPage);