app/Models/Rekam.php

select * from `rekam_diagnosa` where `rekam_id` = 73
---
    function diagnosa()
    {
        return  RekamDiagnosa::where('rekam_id', $this->id)->get();